Revit 2026 API

# DialogBoxData Properties

---

The DialogBoxData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | HelpId | An ID that represents the dialog that has been displayed. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |

#### Reference

DialogBoxData Class

Autodesk.Revit.UI.Events Namespace